; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image1 - mode
	spectrograph5 - mode
	spectrograph2 - mode
	thermograph3 - mode
	image4 - mode
	infrared0 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	Star1 - direction
	Star0 - direction
	GroundStation9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 thermograph3)
	(supports instrument2 image1)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument3 image4)
	(supports instrument3 spectrograph5)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 Star12)
	(have_image Planet10 image1)
	(have_image Planet10 image4)
	(have_image Phenomenon11 thermograph3)
	(have_image Phenomenon11 image1)
	(have_image Star12 infrared0)
	(have_image Star12 spectrograph5)
	(have_image Planet13 image1)
	(have_image Planet14 thermograph3)
	(have_image Phenomenon15 spectrograph5)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 11
2. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 11
3. (turn_to satellite1 star12 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star12)
   goals met: 1 of 11
4. (take_image satellite1 star12 instrument4 infrared0)
   added: (have_image star12 infrared0)
   goals met: 2 of 11
5. (turn_to satellite1 groundstation5 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 11
6. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 1 of 11
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 11
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 11
9. (calibrate satellite1 instrument3 groundstation5)
   added: (calibrated instrument3)
   goals met: 1 of 11
10. (calibrate satellite0 instrument2 groundstation8)
   added: (calibrated instrument2)
   goals met: 1 of 11
11. (turn_to satellite0 phenomenon11 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 11
12. (take_image satellite0 phenomenon11 instrument2 image1)
   added: (have_image phenomenon11 image1)
   goals met: 2 of 11
13. (take_image satellite0 phenomenon11 instrument2 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 3 of 11
14. (turn_to satellite0 phenomenon15 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 11
15. (take_image satellite0 phenomenon15 instrument2 spectrograph5)
   added: (have_image phenomenon15 spectrograph5)
   goals met: 4 of 11
16. (turn_to satellite0 planet13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet13)
   goals met: 4 of 11
17. (take_image satellite0 planet13 instrument2 image1)
   added: (have_image planet13 image1)
   goals met: 5 of 11
18. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 5 of 11
19. (take_image satellite0 planet14 instrument2 thermograph3)
   added: (have_image planet14 thermograph3)
   goals met: 6 of 11
20. (turn_to satellite0 star0 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star0)
   goals met: 7 of 11
21. (turn_to satellite1 planet10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet10)
   goals met: 7 of 11
22. (take_image satellite1 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   goals met: 8 of 11
23. (take_image satellite1 planet10 instrument3 image4)
   added: (have_image planet10 image4)
   goals met: 9 of 11
24. (turn_to satellite1 star12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star12)
   goals met: 10 of 11
25. (take_image satellite1 star12 instrument3 spectrograph5)
   added: (have_image star12 spectrograph5)
   goals met: 11 of 11
